tutorials/compressible/sonicFoam/ras/nacaAirfoil/0/k
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    INLE1           
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    OUTL2           
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    SYMP3           
    {
        type            empty;
    }

    WALL10          
    {
        type            zeroGradient;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
